In [1]:
import pandas as pd
import matplotlib.pyplot as plt

# Skills

In [2]:
df1= pd.read_csv('abdulbaqqi_skills.csv')
df2= pd.read_csv('Aishat_Skill.csv')
df3= pd.read_csv('Bisola_skills.csv')
df4= pd.read_csv('Oluwaferanmi_skills.csv')
df5= pd.read_csv('Samuel_skill.csv')
df6= pd.read_csv('TheophilusSkills.csv')
df7= pd.read_csv('Statesman_skills.csv')

In [3]:
df1

   Unnamed: 0             Skills
0           1         python IOT
1           2  graphics designer
2           3    video animation
3           4       video editor

In [4]:
df1.columns=['Unnamed: 0', 'skills']
df1

   Unnamed: 0             skills
0           1         python IOT
1           2  graphics designer
2           3    video animation
3           4       video editor

In [5]:
df1['Unnamed: 0'] = 'Abdulbaqqi'
df1

   Unnamed: 0             skills
0  Abdulbaqqi         python IOT
1  Abdulbaqqi  graphics designer
2  Abdulbaqqi    video animation
3  Abdulbaqqi       video editor

In [6]:
df1.columns=['name', 'skills']
df1

         name             skills
0  Abdulbaqqi         python IOT
1  Abdulbaqqi  graphics designer
2  Abdulbaqqi    video animation
3  Abdulbaqqi       video editor

In [7]:
df2

,Unnamed: 0,Skill 1.,Skill 2.
0,0,Excellent in Microsoft Office,"Basic Knowledge of java, c programming and python"

In [8]:
df2['skills']= df2['Skill 1.'] + df2['Skill 2.']

In [9]:
df2

,Unnamed: 0,Skill 1.,Skill 2.,skills
0,0,Excellent in Microsoft Office,"Basic Knowledge of java, c programming and python",Excellent in Microsoft OfficeBasic Knowledge o...

In [10]:
df2=df2.drop(['Skill 1.', 'Skill 2.'],axis= 1)
df2

   Unnamed: 0                                             skills
0           0  Excellent in Microsoft OfficeBasic Knowledge o...

In [11]:
df2['Unnamed: 0'] = 'Aishat'
df2

  Unnamed: 0                                             skills
0     Aishat  Excellent in Microsoft OfficeBasic Knowledge o...

In [12]:
df2.columns=['name', 'skills']
df2

     name                                             skills
0  Aishat  Excellent in Microsoft OfficeBasic Knowledge o...

In [13]:
df3

   Unnamed: 0    skills
0           0   Playing
1           1   Reading
2           2    Coding
3           3  Sleeping
4           4  Drinking
5           5   Smoking
6           6  Partying

In [14]:
df3['Unnamed: 0'] = 'Bisola'
df3

  Unnamed: 0    skills
0     Bisola   Playing
1     Bisola   Reading
2     Bisola    Coding
3     Bisola  Sleeping
4     Bisola  Drinking
5     Bisola   Smoking
6     Bisola  Partying

In [15]:
df3.columns=['name', 'skills']
df3

     name    skills
0  Bisola   Playing
1  Bisola   Reading
2  Bisola    Coding
3  Bisola  Sleeping
4  Bisola  Drinking
5  Bisola   Smoking
6  Bisola  Partying

In [16]:
df4

  Skills
0      I
1     am
2   just
3     so
4   cool

In [17]:
df4['Unnamed: 0'] = 0
df4

  Skills  Unnamed: 0
0      I           0
1     am           0
2   just           0
3     so           0
4   cool           0

In [18]:
df4.columns=['skills', 'name']
df4

  skills  name
0      I     0
1     am     0
2   just     0
3     so     0
4   cool     0

In [19]:
df4['name'] = 'Oluwaferanmi'
df4

  skills          name
0      I  Oluwaferanmi
1     am  Oluwaferanmi
2   just  Oluwaferanmi
3     so  Oluwaferanmi
4   cool  Oluwaferanmi

In [20]:
df5= pd.read_csv('Samuel_skill.csv')

In [21]:
df5

,Unnamed: 0,0,1,2,3,4
0,Samuel,Python,Machine learning,MATLAB,Microsoft Word,Microsoft Excel

In [22]:
df5= df5.T
df5

                           0
Unnamed: 0           Samuel
0                     Python
1           Machine learning
2                     MATLAB
3             Microsoft Word
4            Microsoft Excel

In [23]:
df5.to_csv('samuel_new_skills.csv')

In [24]:
df5_new= pd.read_csv('samuel_new_skills.csv', header= 1)

In [25]:
df5_new

   Unnamed: 0           Samuel
0           0            Python
1           1  Machine learning
2           2            MATLAB
3           3    Microsoft Word
4           4   Microsoft Excel

In [26]:
df5_new.columns=['name', 'skills']
df5_new

   name            skills
0     0            Python
1     1  Machine learning
2     2            MATLAB
3     3    Microsoft Word
4     4   Microsoft Excel

In [27]:
df5_new['name'] = 'Samuel'
df5_new

     name            skills
0  Samuel            Python
1  Samuel  Machine learning
2  Samuel            MATLAB
3  Samuel    Microsoft Word
4  Samuel   Microsoft Excel

In [28]:
df6

   Unnamed: 0        0        1          2          3       4
0           0  Python,  Machine  learning,  microsoft  office

In [29]:
df6= df6.T

In [30]:
df6.to_csv('theophilus_new_skills')

In [31]:
df6_new = pd.read_csv('theophilus_new_skills', header=1)

In [32]:
df6_new

   Unnamed: 0          0
0           0    Python,
1           1    Machine
2           2  learning,
3           3  microsoft
4           4     office

In [33]:
df6_new.columns=['name', 'skills']
df6_new

   name     skills
0     0    Python,
1     1    Machine
2     2  learning,
3     3  microsoft
4     4     office

In [34]:
df6_new['name'] = 'Theophilus'
df6_new

         name     skills
0  Theophilus    Python,
1  Theophilus    Machine
2  Theophilus  learning,
3  Theophilus  microsoft
4  Theophilus     office

In [35]:
df7

   Unnamed: 0                     Skills                        Ref
0           0  ['Basic level of python']  ['Dr', 'Tajudeen Oyehan']

In [36]:
df7=df7.drop('Ref', axis= 1)
df7

   Unnamed: 0                     Skills
0           0  ['Basic level of python']

In [37]:
df7.columns=['name', 'skills']
df7

   name                     skills
0     0  ['Basic level of python']

In [38]:
df7['name'] = 'Statesman'
df7

        name                     skills
0  Statesman  ['Basic level of python']

In [42]:
skills= pd.concat([df1,df2,df3,df4,df5_new,df6_new,df7])
skills

C:\Users\JHAYSU\anaconda\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

           name                                             skills
0    Abdulbaqqi                                         python IOT
1    Abdulbaqqi                                  graphics designer
2    Abdulbaqqi                                    video animation
3    Abdulbaqqi                                       video editor
0        Aishat  Excellent in Microsoft OfficeBasic Knowledge o...
0        Bisola                                            Playing
1        Bisola                                            Reading
2        Bisola                                             Coding
3        Bisola                                           Sleeping
4        Bisola                                           Drinking
5        Bisola                                            Smoking
6        Bisola                                           Partying
0  Oluwaferanmi                                                  I
1  Oluwaferanmi                                                 am
2  Oluwaferanmi                                               just
3  Oluwaferanmi                                                 so
4  Oluwaferanmi                                               cool
0        Samuel                                             Python
1        Samuel                                   Machine learning
2        Samuel                                             MATLAB
3        Samuel                                     Microsoft Word
4        Samuel                                    Microsoft Excel
0    Theophilus                                            Python,
1    Theophilus                                            Machine
2    Theophilus                                          learning,
3    Theophilus                                          microsoft
4    Theophilus                                             office
0     Statesman                          ['Basic level of python']

In [43]:
skills.to_csv('skills.csv')